app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY release_date, '--- !ruby/hash:ActiveSupport::HashWithIndifferentAccess
---
    ## getting all the movies and sorting parameters
    allMovies=Movie.find(:all, :order=>@sort ? @sort : :id)
    ## check for ratings selections, and add the parameter
    allMovies.each do |rateMovies|